Revit 2026 API

# MEPBuildingConstructionSetErase Method

---

Removes a specified MEPBuildingConstruction from the set.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	MEPBuildingConstruction item
)
```
```vb
Public Overridable Function Erase (
	item As MEPBuildingConstruction
) As Integer
```
```cpp
public:
virtual int Erase(
	MEPBuildingConstruction^ item
)
```
```fsharp
abstract Erase :
        item : MEPBuildingConstruction -> int
override Erase :
        item : MEPBuildingConstruction -> int
```

#### Parameters

item MEPBuildingConstruction
    The MEPBuildingConstruction to be erased.

#### Return Value

Int32The number of MEPBuildingConstructions that were erased from the set.

#### Reference

MEPBuildingConstructionSet Class

Autodesk.Revit.DB.Mechanical Namespace